backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - &id002 !!python/object/apply:numpy.dtype
            args: [f8, 0, 1]
            state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
          - !!binary |
            Zvr+3X0rvj8=
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv_init
      padding: same
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv_init
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_0_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_init
        - 0
        - 0
        - {}
    name: BN_1_0_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_1, trainable: true}
    inbound_nodes:
    - - - BN_1_0_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            Zvr+3X0rvj8=
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv_1_0_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: conv_1_0_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [1, 1]
      strides: !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - leaky_re_lu_1
        - 0
        - 0
        - {}
    name: average_pooling2d_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_0_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_1_0_1
        - 0
        - 0
        - {}
    name: BN_1_0_2
  - class_name: Permute
    config:
      dims: !!python/tuple [1, 3, 2]
      name: permute_1
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_1
        - 0
        - 0
        - {}
    name: permute_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_2, trainable: true}
    inbound_nodes:
    - - - BN_1_0_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_2
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: zero_padding2d_1
      padding: !!python/tuple
      - !!python/tuple [0, 0]
      - !!python/tuple [72, 72]
      trainable: true
    inbound_nodes:
    - - - permute_1
        - 0
        - 0
        - {}
    name: zero_padding2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            Zvr+3X0rvj8=
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv_1_0_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_2
        - 0
        - 0
        - {}
    name: conv_1_0_2
  - class_name: Permute
    config:
      dims: !!python/tuple [1, 3, 2]
      name: permute_2
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_1
        - 0
        - 0
        - {}
    name: permute_2
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - conv_1_0_2
        - 0
        - 0
        - &id004 {}
      - - permute_2
        - 0
        - 0
        - *id004
    name: add_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_1_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: BN_1_1_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_3, trainable: true}
    inbound_nodes:
    - - - BN_1_1_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [3, 3]
      name: conv_1_1_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_3
        - 0
        - 0
        - {}
    name: conv_1_1_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_1_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_1_1_1
        - 0
        - 0
        - {}
    name: BN_1_1_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_4, trainable: true}
    inbound_nodes:
    - - - BN_1_1_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: &id007 !!python/tuple [3, 3]
      name: conv_1_1_2
      padding: same
      strides: &id008 !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_4
        - 0
        - 0
        - {}
    name: conv_1_1_2
  - class_name: Add
    config: {name: add_2, trainable: true}
    inbound_nodes:
    - - - conv_1_1_2
        - 0
        - 0
        - &id005 {}
      - - add_1
        - 0
        - 0
        - *id005
    name: add_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_2_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: BN_1_2_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_5, trainable: true}
    inbound_nodes:
    - - - BN_1_2_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_1_2_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_5
        - 0
        - 0
        - {}
    name: conv_1_2_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_2_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_1_2_1
        - 0
        - 0
        - {}
    name: BN_1_2_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_6, trainable: true}
    inbound_nodes:
    - - - BN_1_2_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_1_2_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_6
        - 0
        - 0
        - {}
    name: conv_1_2_2
  - class_name: Add
    config: {name: add_3, trainable: true}
    inbound_nodes:
    - - - conv_1_2_2
        - 0
        - 0
        - &id009 {}
      - - add_2
        - 0
        - 0
        - *id009
    name: add_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_3_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: BN_1_3_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_7, trainable: true}
    inbound_nodes:
    - - - BN_1_3_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_1_3_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_7
        - 0
        - 0
        - {}
    name: conv_1_3_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_3_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_1_3_1
        - 0
        - 0
        - {}
    name: BN_1_3_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_8, trainable: true}
    inbound_nodes:
    - - - BN_1_3_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_1_3_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_8
        - 0
        - 0
        - {}
    name: conv_1_3_2
  - class_name: Add
    config: {name: add_4, trainable: true}
    inbound_nodes:
    - - - conv_1_3_2
        - 0
        - 0
        - &id010 {}
      - - add_3
        - 0
        - 0
        - *id010
    name: add_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_4_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: BN_1_4_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_9, trainable: true}
    inbound_nodes:
    - - - BN_1_4_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_1_4_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_9
        - 0
        - 0
        - {}
    name: conv_1_4_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_1_4_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_1_4_1
        - 0
        - 0
        - {}
    name: BN_1_4_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_10, trainable: true}
    inbound_nodes:
    - - - BN_1_4_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUoz8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_1_4_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_10
        - 0
        - 0
        - {}
    name: conv_1_4_2
  - class_name: Add
    config: {name: add_5, trainable: true}
    inbound_nodes:
    - - - conv_1_4_2
        - 0
        - 0
        - &id011 {}
      - - add_4
        - 0
        - 0
        - *id011
    name: add_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_0_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: BN_2_0_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_11, trainable: true}
    inbound_nodes:
    - - - BN_2_0_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_2_0_1
      padding: same
      strides: &id012 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_11
        - 0
        - 0
        - {}
    name: conv_2_0_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_2
      padding: valid
      pool_size: *id012
      strides: *id012
      trainable: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: average_pooling2d_2
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_0_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_2_0_1
        - 0
        - 0
        - {}
    name: BN_2_0_2
  - class_name: Permute
    config:
      dims: &id019 !!python/tuple [1, 3, 2]
      name: permute_3
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_2
        - 0
        - 0
        - {}
    name: permute_3
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_12, trainable: true}
    inbound_nodes:
    - - - BN_2_0_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_12
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: zero_padding2d_2
      padding: !!python/tuple
      - !!python/tuple [0, 0]
      - !!python/tuple [80, 80]
      trainable: true
    inbound_nodes:
    - - - permute_3
        - 0
        - 0
        - {}
    name: zero_padding2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_2_0_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_12
        - 0
        - 0
        - {}
    name: conv_2_0_2
  - class_name: Permute
    config:
      dims: &id020 !!python/tuple [1, 3, 2]
      name: permute_4
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_2
        - 0
        - 0
        - {}
    name: permute_4
  - class_name: Add
    config: {name: add_6, trainable: true}
    inbound_nodes:
    - - - conv_2_0_2
        - 0
        - 0
        - &id013 {}
      - - permute_4
        - 0
        - 0
        - *id013
    name: add_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_1_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: BN_2_1_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_13, trainable: true}
    inbound_nodes:
    - - - BN_2_1_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_2_1_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_13
        - 0
        - 0
        - {}
    name: conv_2_1_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_1_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_2_1_1
        - 0
        - 0
        - {}
    name: BN_2_1_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_14, trainable: true}
    inbound_nodes:
    - - - BN_2_1_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_2_1_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_14
        - 0
        - 0
        - {}
    name: conv_2_1_2
  - class_name: Add
    config: {name: add_7, trainable: true}
    inbound_nodes:
    - - - conv_2_1_2
        - 0
        - 0
        - &id014 {}
      - - add_6
        - 0
        - 0
        - *id014
    name: add_7
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_2_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: BN_2_2_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_15, trainable: true}
    inbound_nodes:
    - - - BN_2_2_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_2_2_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_15
        - 0
        - 0
        - {}
    name: conv_2_2_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_2_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_2_2_1
        - 0
        - 0
        - {}
    name: BN_2_2_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_16, trainable: true}
    inbound_nodes:
    - - - BN_2_2_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_2_2_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_16
        - 0
        - 0
        - {}
    name: conv_2_2_2
  - class_name: Add
    config: {name: add_8, trainable: true}
    inbound_nodes:
    - - - conv_2_2_2
        - 0
        - 0
        - &id015 {}
      - - add_7
        - 0
        - 0
        - *id015
    name: add_8
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_3_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: BN_2_3_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_17, trainable: true}
    inbound_nodes:
    - - - BN_2_3_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_2_3_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_17
        - 0
        - 0
        - {}
    name: conv_2_3_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_3_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_2_3_1
        - 0
        - 0
        - {}
    name: BN_2_3_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_18, trainable: true}
    inbound_nodes:
    - - - BN_2_3_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_18
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_2_3_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_18
        - 0
        - 0
        - {}
    name: conv_2_3_2
  - class_name: Add
    config: {name: add_9, trainable: true}
    inbound_nodes:
    - - - conv_2_3_2
        - 0
        - 0
        - &id016 {}
      - - add_8
        - 0
        - 0
        - *id016
    name: add_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_4_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_9
        - 0
        - 0
        - {}
    name: BN_2_4_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_19, trainable: true}
    inbound_nodes:
    - - - BN_2_4_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_2_4_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_19
        - 0
        - 0
        - {}
    name: conv_2_4_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_2_4_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_2_4_1
        - 0
        - 0
        - {}
    name: BN_2_4_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_20, trainable: true}
    inbound_nodes:
    - - - BN_2_4_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_20
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            aWFg2Bn8mj8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_2_4_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_20
        - 0
        - 0
        - {}
    name: conv_2_4_2
  - class_name: Add
    config: {name: add_10, trainable: true}
    inbound_nodes:
    - - - conv_2_4_2
        - 0
        - 0
        - &id017 {}
      - - add_9
        - 0
        - 0
        - *id017
    name: add_10
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_3_0_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_10
        - 0
        - 0
        - {}
    name: BN_3_0_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_21, trainable: true}
    inbound_nodes:
    - - - BN_3_0_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_21
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 640
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUkz8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_3_0_1
      padding: same
      strides: &id018 !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_21
        - 0
        - 0
        - {}
    name: conv_3_0_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      name: average_pooling2d_3
      padding: valid
      pool_size: *id018
      strides: *id018
      trainable: true
    inbound_nodes:
    - - - add_10
        - 0
        - 0
        - {}
    name: average_pooling2d_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_3_0_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_3_0_1
        - 0
        - 0
        - {}
    name: BN_3_0_2
  - class_name: Permute
    config:
      dims: *id019
      name: permute_5
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_3
        - 0
        - 0
        - {}
    name: permute_5
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_22, trainable: true}
    inbound_nodes:
    - - - BN_3_0_2
        - 0
        - 0
        - {}
    name: leaky_re_lu_22
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: zero_padding2d_3
      padding: !!python/tuple
      - !!python/tuple [0, 0]
      - !!python/tuple [160, 160]
      trainable: true
    inbound_nodes:
    - - - permute_5
        - 0
        - 0
        - {}
    name: zero_padding2d_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 640
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUkz8=
      kernel_regularizer: null
      kernel_size: *id007
      name: conv_3_0_2
      padding: same
      strides: *id008
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_22
        - 0
        - 0
        - {}
    name: conv_3_0_2
  - class_name: Permute
    config:
      dims: *id020
      name: permute_6
      trainable: true
    inbound_nodes:
    - - - zero_padding2d_3
        - 0
        - 0
        - {}
    name: permute_6
  - class_name: Add
    config: {name: add_11, trainable: true}
    inbound_nodes:
    - - - conv_3_0_2
        - 0
        - 0
        - &id021 {}
      - - permute_6
        - 0
        - 0
        - *id021
    name: add_11
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_3_1_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - add_11
        - 0
        - 0
        - {}
    name: BN_3_1_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_23, trainable: true}
    inbound_nodes:
    - - - BN_3_1_1
        - 0
        - 0
        - {}
    name: leaky_re_lu_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 32, 32, 3]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 640
      kernel_constraint: null
      kernel_initializer:
        class_name: RandomNormal
        config:
          mean: 0.0
          seed: null
          stddev: !!python/object/apply:numpy.core.multiarray.scalar
          - *id002
          - !!binary |
            kZ4q2cMUkz8=
      kernel_regularizer: null
      kernel_size: *id006
      name: conv_3_1_1
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - leaky_re_lu_23
        - 0
        - 0
        - {}
    name: conv_3_1_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.9
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: BN_3_1_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv_3_1_1
        - 0
        - 0
        - {}
    name: BN_3_1_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: leaky_re_lu_24, trainable: true}
    inbound_nodes:
